# Pandas Apply Functions Walkthrough

In [1]:
import pandas as pd
import numpy as np

In [2]:
 def extract_city_name(df):
    df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
    return df

def add_country_name(df, country_name=None):
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

df_p = pd.DataFrame({'city_and_code':['Chicago, IL']})

In [3]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [5]:
(df_p.pipe(extract_city_name).pipe(add_country_name, country_name='US'))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

### Row or column-wise function application

In [6]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [7]:
df.apply(np.mean)

one      0.402633
two     -0.545958
three    0.346512
dtype: float64

In [8]:
df.apply(np.mean, axis=1)

a   -0.342934
b    0.377755
c   -0.488377
d    0.540667
dtype: float64

In [9]:
df.apply(lambda x: x.max() - x.min())

one      0.732017
two      1.835294
three    1.804809
dtype: float64

In [10]:
df.apply(np.cumsum)

        one       two     three
a  0.256126 -0.941994       NaN
b  0.366003 -0.660260  0.741655
c  1.207898 -2.213821 -0.011810
d       NaN -2.183831  1.039535

In [11]:
df.apply(np.exp)

        one       two     three
a  1.291915  0.389850       NaN
b  1.116142  1.325425  2.099407
c  2.320760  0.211494  0.470733
d       NaN  1.030444  2.861496

In [12]:
def own_function(x):
    return x*x

df.apply(own_function)

        one       two     three
a  0.065600  0.887352       NaN
b  0.012073  0.079374  0.550052
c  0.708787  2.413552  0.567709
d       NaN  0.000899  1.105326

In [13]:
def subtract_and_divide(x, sub, divide=1):
    return (x-sub)/divide

df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.581291 -1.980665       NaN
b -1.630041 -1.572756 -1.419448
c -1.386035 -2.184520 -1.917822
d       NaN -1.656670 -1.316218

In [14]:
def subtract(x,sub):
    return (x-sub)

df.apply(subtract, args=(5,))

        one       two     three
a -4.743874 -5.941994       NaN
b -4.890122 -4.718267 -4.258345
c -4.158105 -6.553561 -5.753465
d       NaN -4.970010 -3.948655